In [2]:
#pandas

# it is pandas a python library and used for working with data set
# it has functions for analzing , clearing ,exploring and manipulating data .
# created by Wes McKinney in 2008
# it is refered to panal data and python data.
# Works with heterogeneous data (numbers, strings, dates)

# Why use :


# Import Datasets

# • 	Directly reads from CSV, Excel, JSON, SQL databases using , , .
# • 	Saves results back with , , etc.
# • 	Much more versatile than NumPy, which mainly handles binary  or .

# Data Cleaning

# • 	Built-in handling of missing values ().
# • 	Functions like , ,  make cleaning seamless.
# • 	NumPy requires manual masking and conditional logic.

# Size Mutability

# • 	Pandas  and  can add/delete columns and rows dynamically.
# • 	NumPy arrays are fixed-size; resizing requires creating new arrays.

# Reshape & Pivoting

# • 	Functions like , , ,  allow flexible reshaping.
# • 	Ideal for transforming raw data into analysis-ready formats.
# • 	NumPy reshaping is limited to dimensions, not labels.

# Efficient Manipulation

# • 	Vectorized operations across rows/columns.
# • 	Powerful indexing (, ) and filtering with conditions.
# • 	Grouping and aggregation () for quick summaries.

# Statistical Analysis

# • 	Built-in descriptive stats: , , , , .
# • 	Time-series analysis tools (, ).
# • 	Integrates smoothly with libraries like Matplotlib, Seaborn, scikit-learn.

In [3]:
# Data Strucure for python - are collections of data types that provide the best way of organizing item(values)
# in terms of memory usage.

# Primary DS

# 1.series (1D) = a one-dimensional labelled homogenous array, size mutable
# 2. Dataframes(2D) = two dimensional labeled size mutable tabular structure with potentailly heterogenously typed columns.

In [4]:
import pandas as pd

In [5]:
s = pd.Series([3, -5, 7, 4])
s

0    3
1   -5
2    7
3    4
dtype: int64

In [6]:
s.values

array([ 3, -5,  7,  4], dtype=int64)

In [7]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
print(s.name)

None

In [9]:
s.name= "Price"
s

0    3
1   -5
2    7
3    4
Name: Price, dtype: int64



Indexing

In [10]:


s[0]

3

In [11]:
s[0:2]

0    3
1   -5
Name: Price, dtype: int64

In [12]:
s[2:4]

2    7
3    4
Name: Price, dtype: int64

In [13]:
s.iloc[0]

3

In [14]:
s.iloc[0:2]

0    3
1   -5
Name: Price, dtype: int64

In [15]:
s.iloc[[0,1,2]]

0    3
1   -5
2    7
Name: Price, dtype: int64

In [16]:
index = ['a','b','c','d']
s.index = index
s

a    3
b   -5
c    7
d    4
Name: Price, dtype: int64

In [17]:
data = pd.Series([10, 20, 30], index=['a', 'b', 'c'])

# Access by index (position)
print(data[0])   # 10

# Access by label
print(data['b']) # 20

10
20

C:\Users\Ankit Mahato\AppData\Local\Temp\ipykernel_7196\2313148621.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(data[0])   # 10

In [18]:
# Dataframe:- A DataFrame is essentially a labeled data structure with rows and columns,
#  similar to a spreadsheet or SQL table.

In [19]:
# 1. df.iloc[0]
# -------------------------

# iloc = integer-location based indexing.

# df.iloc[0] → accesses the first row (index position 0).

# Returns a Series representing that row.

# 2. df.iloc[4:6]
# -------------------------

# iloc[4:6] → accesses rows by integer positions 4 and 5 (Python slicing is exclusive of the last index).

# So it gives you the 5th and 6th rows.

# Returns a DataFrame with those two rows.

# 3. df.loc[4:6]
# -------------------------

# loc = label-based indexing.

# df.loc[4:6] → selects rows with labels from 4 to 6 (inclusive).

# -------------------------

# Important: Unlike iloc, loc slicing is inclusive of the last label.

# So if your DataFrame has default integer index starting from 0:

# iloc[4:6] → rows at positions 4 and 5

# loc[4:6] → rows with index labels 4, 5, and 6

# Example (assuming default integer index):


data = {
    "Name": ["Ankit", "Ravi", "Priya"],
    "Age": [21, 22, 23],
    "Course": ["BCA", "B.Tech", "MBA"]
}

df = pd.DataFrame(data)
print(df)

    Name  Age  Course
0  Ankit   21     BCA
1   Ravi   22  B.Tech
2  Priya   23     MBA

In [20]:
index = ['a','b','c']
df.index = index
df

    Name  Age  Course
a  Ankit   21     BCA
b   Ravi   22  B.Tech
c  Priya   23     MBA

In [21]:
# Notes - .iloc is position-based indexing. It doesn’t care what your index labels are; it just uses row numbers (0, 1, 2, …).

# df.iloc['a']

# Remeber it

In [22]:
print(df.iloc[0])     # First row (position 0)

Name      Ankit
Age          21
Course      BCA
Name: a, dtype: object

In [23]:
print(df.iloc[1:2])

   Name  Age  Course
b  Ravi   22  B.Tech

In [24]:
print(df.iloc[[0,1,2]]) # multile values so pass index which you want

    Name  Age  Course
a  Ankit   21     BCA
b   Ravi   22  B.Tech
c  Priya   23     MBA

In [25]:
# loc -> label based indexing

s.loc['a']

3

In [26]:
# in label based indexing your start as well as stop value both are included in the output.
s['a':'c']

a    3
b   -5
c    7
Name: Price, dtype: int64

In [27]:
fruit_protein = {
    "apple": 1.2,
    "banana": 0.5,
    "blackberries":2.0,
    "kiwi":1.1,
    "mango":0.8
}

In [28]:
s2=pd.Series(fruit_protein,name="Protein")
s2

apple           1.2
banana          0.5
blackberries    2.0
kiwi            1.1
mango           0.8
Name: Protein, dtype: float64

In [29]:
# Conditional Selection:

s2[s2>1]

apple           1.2
blackberries    2.0
kiwi            1.1
Name: Protein, dtype: float64

In [30]:
# Logical opertors: and or , not

In [31]:
s2[(s2>0.5) & (s2<=2)]

apple           1.2
blackberries    2.0
kiwi            1.1
mango           0.8
Name: Protein, dtype: float64

In [32]:
# not operator:

s2[~(s2>1)]

banana    0.5
mango     0.8
Name: Protein, dtype: float64

In [33]:
# Modify the series:

s2['apple']=1.6
s2

apple           1.6
banana          0.5
blackberries    2.0
kiwi            1.1
mango           0.8
Name: Protein, dtype: float64

In [34]:
import numpy as np
ser=pd.Series(['a',np.nan,1,np.nan,2])
ser.notnull().sum()

3

In [35]:


# DataFrame:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

In [36]:
df=pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [37]:
df.head(2)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [38]:
df.tail(3)

    Name   Age Department   Salary
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [39]:
# iloc and loc

df.iloc[0:3]

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0

In [40]:

df.loc[1:4]

      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN

In [41]:

df.loc[1:3,['Department','Salary']]

  Department   Salary
1         IT  60000.0
2    Finance  70000.0
3         IT  62000.0

In [42]:
df[["Age","Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [43]:
df.drop("Age",axis=1)

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [44]:
df  # age column still there so in order to remove permanent inplace=ture because its by default false

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [45]:
# df.drop("Age",axis=1 , inplace=True)

In [46]:
# df # now drop

In [47]:
df.shape

(6, 4)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [49]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [50]:
# Broadcasting

df["Salary"] = df["Salary"] +5000

In [51]:
df["Salary"]

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

In [52]:
# Renaming columns:

df.rename(columns={"Department":"Dept"},inplace=True)

In [53]:
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  55000.0
1      Bob  30.0       IT  65000.0
2  Charlie  35.0  Finance  75000.0
3    David   NaN       IT  67000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  55000.0

In [54]:
df["Salary"].unique()

array([55000., 65000., 75000., 67000.,    nan])

In [55]:
df["Dept"].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [56]:
df["Dept"].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [57]:
df["Promoted Salary"] = df["Salary"] *10

In [58]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [59]:
# Data Cleaning

df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

In [60]:
df.dropna(how = "any") #any row that had any null

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
5    Alice  25.0       HR  55000.0         550000.0

In [61]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [62]:
df.dropna(how = "all") #all row that had all null

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [63]:
df.fillna(0)

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   0.0       IT  67000.0         670000.0
4      Eve  29.0       HR      0.0              0.0
5    Alice  25.0       HR  55000.0         550000.0

In [64]:
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [65]:
df["Salary"].fillna(df["Salary"].mean(),inplace=True)

C:\Users\Ankit Mahato\AppData\Local\Temp\ipykernel_7196\2156103880.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Salary"].fillna(df["Salary"].mean(),inplace=True)

In [66]:
df["Promoted Salary"].fillna(df["Promoted Salary"].mean(),inplace=True)

C:\Users\Ankit Mahato\AppData\Local\Temp\ipykernel_7196\448367279.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Promoted Salary"].fillna(df["Promoted Salary"].mean(),inplace=True)

In [67]:
df["Age"].fillna(method = "ffill")

C:\Users\Ankit Mahato\AppData\Local\Temp\ipykernel_7196\544980945.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method = "ffill")

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [68]:
df["Age"].fillna(method = "bfill")

C:\Users\Ankit Mahato\AppData\Local\Temp\ipykernel_7196\3026805218.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method = "bfill")

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [69]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR  63400.0         634000.0
5    Alice  25.0       HR  55000.0         550000.0

In [70]:
df["Name"]= df["Name"].replace("Charlie","Rose")

In [71]:
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  29.0       HR  63400.0         634000.0
5  Alice  25.0       HR  55000.0         550000.0

In [72]:
# Duplicates:

df_dup = df[df.duplicated(keep="last")]
df_dup

    Name   Age Dept   Salary  Promoted Salary
0  Alice  25.0   HR  55000.0         550000.0

In [73]:
df = df.drop_duplicates()
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  29.0       HR  63400.0         634000.0

In [74]:
# invalid values:
# lamda

df["Promoted Salary"] = df["Promoted Salary"].apply(lambda x: x/10  if x > 6500000 else x)
df

C:\Users\Ankit Mahato\AppData\Local\Temp\ipykernel_7196\3562947703.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Promoted Salary"] = df["Promoted Salary"].apply(lambda x: x/10  if x > 6500000 else x)

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  29.0       HR  63400.0         634000.0

In [75]:
# name="alice_fernandes"
# df[["first_name","last_name"]]= df["name"].str.split("_")

In [76]:
# apply and lambda
def mulitiplying_age(x):
  return x*2
df["Age"] =df["Age"].apply(mulitiplying_age)

C:\Users\Ankit Mahato\AppData\Local\Temp\ipykernel_7196\1460355825.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"] =df["Age"].apply(mulitiplying_age)

In [77]:
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  50.0       HR  55000.0         550000.0
1    Bob  60.0       IT  65000.0         650000.0
2   Rose  70.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  58.0       HR  63400.0         634000.0

In [78]:
df["Age"] =df["Age"].apply(lambda x: x/2)

C:\Users\Ankit Mahato\AppData\Local\Temp\ipykernel_7196\2882609309.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"] =df["Age"].apply(lambda x: x/2)

In [79]:
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  29.0       HR  63400.0         634000.0

In [80]:
# Join and Merges

department_info = {
    "Dept": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}

df2 = pd.DataFrame(department_info)
df2

      Dept       Location Manager
0       HR       New York   Laura
1       IT  San Francisco   Steve
2  Finance        Chicago    Nina

In [81]:
# Concat

pd.concat([df,df2])

    Name   Age     Dept   Salary  Promoted Salary       Location Manager
0  Alice  25.0       HR  55000.0         550000.0            NaN     NaN
1    Bob  30.0       IT  65000.0         650000.0            NaN     NaN
2   Rose  35.0  Finance  75000.0         750000.0            NaN     NaN
3  David   NaN       IT  67000.0         670000.0            NaN     NaN
4    Eve  29.0       HR  63400.0         634000.0            NaN     NaN
0    NaN   NaN       HR      NaN              NaN       New York   Laura
1    NaN   NaN       IT      NaN              NaN  San Francisco   Steve
2    NaN   NaN  Finance      NaN              NaN        Chicago    Nina

In [82]:
pd.concat([df,df2],axis=1)

,Name,Age,Dept,Salary,Promoted Salary,Dept,Location,Manager
0,Alice,25.0,HR,55000.0,550000.0,HR,New York,Laura
1,Bob,30.0,IT,65000.0,650000.0,IT,San Francisco,Steve
2,Rose,35.0,Finance,75000.0,750000.0,Finance,Chicago,Nina
3,David,NaN,IT,67000.0,670000.0,NaN,NaN,NaN
4,Eve,29.0,HR,63400.0,634000.0,NaN,NaN,NaN

In [83]:
pd.merge(df,df2,on="Dept")

    Name   Age     Dept   Salary  Promoted Salary       Location Manager
0  Alice  25.0       HR  55000.0         550000.0       New York   Laura
1    Bob  30.0       IT  65000.0         650000.0  San Francisco   Steve
2   Rose  35.0  Finance  75000.0         750000.0        Chicago    Nina
3  David   NaN       IT  67000.0         670000.0  San Francisco   Steve
4    Eve  29.0       HR  63400.0         634000.0       New York   Laura

In [84]:
# Import File
df = pd.read_csv(r"E:\Data Science\5.Python Libaries\Code\Part 1\Module 3.Python Libraries (Numpy,Pandas,matplotlib,Seaborn)\student_exam_scores.csv")
# Read CSV file
print(df)

    student_id  hours_studied  sleep_hours  attendance_percent  \
0         S001            8.0          8.8                72.1
1         S002            1.3          8.6                60.7
2         S003            4.0          8.2                73.7
3         S004            3.5          4.8                95.1
4         S005            9.1          6.4                89.8
..         ...            ...          ...                 ...
195       S196           10.5          5.4                94.0
196       S197            7.1          6.1                85.1
197       S198            1.6          6.9                63.8
198       S199           12.0          7.3                50.5
199       S200           10.2          6.3                97.4

     previous_scores  exam_score
0                 45        30.2
1                 55        25.0
2                 86        35.8
3                 66        34.0
4                 71        40.3
..               ...         ...
195               87        42.7
196               92        40.4
197               76        28.2
198               58        42.0
199               68        37.8

[200 rows x 6 columns]

In [85]:
print(type(df))
print(df.head())  # Print first 5 rows of DataFrame if no argument is passed
print(df.tail())  # Print last 5 rows of DataFrame if no argument is passed

<class 'pandas.core.frame.DataFrame'>
  student_id  hours_studied  sleep_hours  attendance_percent  previous_scores  \
0       S001            8.0          8.8                72.1               45
1       S002            1.3          8.6                60.7               55
2       S003            4.0          8.2                73.7               86
3       S004            3.5          4.8                95.1               66
4       S005            9.1          6.4                89.8               71

   exam_score
0        30.2
1        25.0
2        35.8
3        34.0
4        40.3
    student_id  hours_studied  sleep_hours  attendance_percent  \
195       S196           10.5          5.4                94.0
196       S197            7.1          6.1                85.1
197       S198            1.6          6.9                63.8
198       S199           12.0          7.3                50.5
199       S200           10.2          6.3                97.4

     previous_scores  exam_score
195               87        42.7
196               92        40.4
197               76        28.2
198               58        42.0
199               68        37.8

In [ ]:
print(df.sample())   # Prints 1 random row of DataFrame if no argument is passed
print("----------------------------")
print(df.sample(5))  # Prints 5 random rows of DataFrame if argument (n=5) is passed

   student_id  hours_studied  sleep_hours  attendance_percent  \
46       S047            2.1          5.2                86.0

    previous_scores  exam_score
46               87        31.6
----------------------------
    student_id  hours_studied  sleep_hours  attendance_percent  \
37        S038            7.8          5.2                92.4
3         S004            3.5          4.8                95.1
162       S163            3.5          7.0                75.3
100       S101            1.1          8.5                81.1
82        S083            7.4          7.2                67.6

     previous_scores  exam_score
37                57        38.3
3                 66        34.0
162               54        30.0
100               92        31.4
82                95        39.8

In [ ]:
print(df.columns)  # Print column names of DataFrame
print("----------------------------")
print(df.shape)  # Print shape of DataFrame (rows, columns)
print("----------------------------")

Index(['student_id', 'hours_studied', 'sleep_hours', 'attendance_percent',
       'previous_scores', 'exam_score'],
      dtype='object')
----------------------------
(200, 6)
----------------------------

In [ ]:
print(df.describe())  # Print statistical summary of DataFrame

       hours_studied  sleep_hours  attendance_percent  previous_scores  \
count     200.000000   200.000000          200.000000       200.000000
mean        6.325500     6.622000           74.830000        66.800000
std         3.227317     1.497138           14.249905        15.663869
min         1.000000     4.000000           50.300000        40.000000
25%         3.500000     5.300000           62.200000        54.000000
50%         6.150000     6.700000           75.250000        67.500000
75%         9.000000     8.025000           87.425000        80.000000
max        12.000000     9.000000          100.000000        95.000000

       exam_score
count  200.000000
mean    33.955000
std      6.789548
min     17.100000
25%     29.500000
50%     34.050000
75%     38.750000
max     51.300000

In [ ]:
print(df.info())                 # Print summary information about the DataFrame
print("----------------------------")

#  df.info()

# Prints basic summary of the DataFrame:

# Index range

# Column names

# Non-null counts

# Data types

print(df.info(memory_usage='deep'))  # Print summary info with detailed memory usage

# df.info() → shows a quick, approximate memory usage.

# df.info(memory_usage='deep') → shows accurate memory usage, including the real size of strings/objects.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   student_id          200 non-null    object
 1   hours_studied       200 non-null    float64
 2   sleep_hours         200 non-null    float64
 3   attendance_percent  200 non-null    float64
 4   previous_scores     200 non-null    int64
 5   exam_score          200 non-null    float64
dtypes: float64(4), int64(1), object(1)
memory usage: 9.5+ KB
None
----------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   student_id          200 non-null    object
 1   hours_studied       200 non-null    float64
 2   sleep_hours         200 non-null    float64
 3   attendance_percent  200 non-null    float64
 4   previous_scores     200 non-null    int64
 5   exam_score          200 non-null    float64
dtypes: float64(4), int64(1), object(1)
memory usage: 19.9 KB
None

In [ ]:
print(df['exam_score']) # Print specific column of DataFrame

0      30.2
1      25.0
2      35.8
3      34.0
4      40.3
       ...
195    42.7
196    40.4
197    28.2
198    42.0
199    37.8
Name: exam_score, Length: 200, dtype: float64

In [ ]:
df.isnull()  # Check for missing values in DataFrame
print("----------------------------")
df.isnull().sum()  # Sum of missing values in each column

----------------------------

student_id            0
hours_studied         0
sleep_hours           0
attendance_percent    0
previous_scores       0
exam_score            0
dtype: int64

In [ ]:
df[['exam_score', 'sleep_hours']]  # Access specific columns of DataFrame

     exam_score  sleep_hours
0          30.2          8.8
1          25.0          8.6
2          35.8          8.2
3          34.0          4.8
4          40.3          6.4
..          ...          ...
195        42.7          5.4
196        40.4          6.1
197        28.2          6.9
198        42.0          7.3
199        37.8          6.3

[200 rows x 2 columns]

In [ ]:
print(df.loc[4:6])    # Rows with labels 4, 5, 6 // selection includes last label

  student_id  hours_studied  sleep_hours  attendance_percent  previous_scores  \
4       S005            9.1          6.4                89.8               71
5       S006            8.4          5.1                58.5               75
6       S007           10.8          6.0                54.2               88

   exam_score
4        40.3
5        35.7
6        37.9

In [ ]:
df.sort_values(by='exam_score')  # Sort DataFrame by 'exam_score' column in ascending order

,student_id,hours_studied,sleep_hours,attendance_percent,previous_scores,exam_score
19,S020,1.1,5.5,53.6,65,17.1
7,S008,2.0,4.3,75.8,55,18.3
142,S143,3.9,4.1,55.4,53,19.0
183,S184,2.1,6.0,54.3,54,19.4
70,S071,3.3,8.1,70.4,40,20.8
...,...,...,...,...,...,...
71,S072,11.4,5.5,77.1,85,47.9
120,S121,9.4,8.3,100.0,78,47.9
60,S061,11.9,8.4,53.9,78,48.6
83,S084,10.9,5.3,87.7,88,48.9
86,S087,12.0,8.2,71.0,95,51.3

In [ ]:
df.sort_index()  # Sort DataFrame by its index in ascending order

,student_id,hours_studied,sleep_hours,attendance_percent,previous_scores,exam_score
0,S001,8.0,8.8,72.1,45,30.2
1,S002,1.3,8.6,60.7,55,25.0
2,S003,4.0,8.2,73.7,86,35.8
3,S004,3.5,4.8,95.1,66,34.0
4,S005,9.1,6.4,89.8,71,40.3
...,...,...,...,...,...,...
195,S196,10.5,5.4,94.0,87,42.7
196,S197,7.1,6.1,85.1,92,40.4
197,S198,1.6,6.9,63.8,76,28.2
198,S199,12.0,7.3,50.5,58,42.0
199,S200,10.2,6.3,97.4,68,37.8

In [ ]:
df.groupby('attendance_percent')

In [ ]:
df.to_csv('output.csv')  # Save DataFrame to CSV file
df.to_excel('output.xlsx',index=False)  # Save DataFrame to Excel file

In [ ]:
selection = df['exam_score']  # Select 'exam_score' column from DataFrame
print(selection)

print("------------")

selection1 = df[['exam_score','sleep_hours']]  # Select multiple columns
print(selection1)

0      30.2
1      25.0
2      35.8
3      34.0
4      40.3
       ...
195    42.7
196    40.4
197    28.2
198    42.0
199    37.8
Name: exam_score, Length: 200, dtype: float64
------------
     exam_score  sleep_hours
0          30.2          8.8
1          25.0          8.6
2          35.8          8.2
3          34.0          4.8
4          40.3          6.4
..          ...          ...
195        42.7          5.4
196        40.4          6.1
197        28.2          6.9
198        42.0          7.3
199        37.8          6.3

[200 rows x 2 columns]

In [ ]:
fittered_row = df['attendance_percent'] > 80  # Filter rows where 'attendance' > 80%
print(df[fittered_row])  # Print filtered DataFrame

print('------------')

fittered_row1 = (df['attendance_percent'] > 80) & (df['exam_score'] > 90)  # Filter rows where 'attendance' > 80% and 'exam_score' > 90
print(df[fittered_row1])  # Print filtered DataFrame

    student_id  hours_studied  sleep_hours  attendance_percent  \
3         S004            3.5          4.8                95.1
4         S005            9.1          6.4                89.8
8         S009            5.6          5.9                81.6
10        S011            3.4          5.3                90.9
11        S012            6.6          7.9                87.6
..         ...            ...          ...                 ...
190       S191            5.6          8.5                92.5
193       S194           11.2          6.7                89.9
195       S196           10.5          5.4                94.0
196       S197            7.1          6.1                85.1
199       S200           10.2          6.3                97.4

     previous_scores  exam_score
3                 66        34.0
4                 71        40.3
8                 84        34.7
10                81        29.3
11                85        35.1
..               ...         ...
190               43        32.2
193               59        46.7
195               87        42.7
196               92        40.4
199               68        37.8

[85 rows x 6 columns]
------------
Empty DataFrame
Columns: [student_id, hours_studied, sleep_hours, attendance_percent, previous_scores, exam_score]
Index: []

In [ ]:
fittered_row1 = (df['sleep_hours'] > 8) | (df['attendance_percent'] > 10)  # Filter rows where 'sleep_hours' > 8 and 'attendance_percent' < 10
print(df[fittered_row1])  # Print filtered DataFrame

    student_id  hours_studied  sleep_hours  attendance_percent  \
0         S001            8.0          8.8                72.1
1         S002            1.3          8.6                60.7
2         S003            4.0          8.2                73.7
3         S004            3.5          4.8                95.1
4         S005            9.1          6.4                89.8
..         ...            ...          ...                 ...
195       S196           10.5          5.4                94.0
196       S197            7.1          6.1                85.1
197       S198            1.6          6.9                63.8
198       S199           12.0          7.3                50.5
199       S200           10.2          6.3                97.4

     previous_scores  exam_score
0                 45        30.2
1                 55        25.0
2                 86        35.8
3                 66        34.0
4                 71        40.3
..               ...         ...
195               87        42.7
196               92        40.4
197               76        28.2
198               58        42.0
199               68        37.8

[200 rows x 6 columns]

In [ ]:
# using OR Condition

filtered_or =(df['previous_scores'] > 50) | (df['exam_score'] > 90)
print(df[filtered_or])

    student_id  hours_studied  sleep_hours  attendance_percent  \
1         S002            1.3          8.6                60.7
2         S003            4.0          8.2                73.7
3         S004            3.5          4.8                95.1
4         S005            9.1          6.4                89.8
5         S006            8.4          5.1                58.5
..         ...            ...          ...                 ...
195       S196           10.5          5.4                94.0
196       S197            7.1          6.1                85.1
197       S198            1.6          6.9                63.8
198       S199           12.0          7.3                50.5
199       S200           10.2          6.3                97.4

     previous_scores  exam_score
1                 55        25.0
2                 86        35.8
3                 66        34.0
4                 71        40.3
5                 75        35.7
..               ...         ...
195               87        42.7
196               92        40.4
197               76        28.2
198               58        42.0
199               68        37.8

[163 rows x 6 columns]